_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
embedding_1 (Embedding)      (None, None, 50)          200000    
_________________________________________________________________
lstm_1 (LSTM)                (None, None, 300)         421200    
_________________________________________________________________
dropout_1 (Dropout)          (None, None, 300)         0         
_________________________________________________________________
mean_over_time_1 (MeanOverTi (None, 300)               0         
_________________________________________________________________
dense_1 (Dense)              (None, 1)                 301       
_________________________________________________________________
activation_1 (Activation)    (None, 1)                 0         
=================================================================
Total params: 621,501
Trainable params: 621,501
Non-trainable params: 0
_________________________________________________________________
