_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
embedding_1 (Embedding)      (None, None, 50)          200000    
_________________________________________________________________
conv1d_with_masking_1 (Conv1 (None, None, 50)          7550      
_________________________________________________________________
lstm_1 (LSTM)                (None, 300)               421200    
_________________________________________________________________
dropout_1 (Dropout)          (None, 300)               0         
_________________________________________________________________
dense_1 (Dense)              (None, 1)                 301       
_________________________________________________________________
activation_1 (Activation)    (None, 1)                 0         
=================================================================
Total params: 629,051
Trainable params: 629,051
Non-trainable params: 0
_________________________________________________________________
