{
  "class_name": "Sequential", 
  "keras_version": "2.0.8", 
  "config": [
    {
      "class_name": "Embedding", 
      "config": {
        "embeddings_initializer": {
          "class_name": "RandomUniform", 
          "config": {
            "maxval": 0.05, 
            "seed": null, 
            "minval": -0.05
          }
        }, 
        "name": "embedding_1", 
        "dtype": "float32", 
        "output_dim": 50, 
        "trainable": true, 
        "embeddings_regularizer": null, 
        "input_dim": 4000, 
        "mask_zero": true, 
        "embeddings_constraint": null, 
        "batch_input_shape": [
          null, 
          null
        ], 
        "activity_regularizer": null, 
        "input_length": null
      }
    }, 
    {
      "class_name": "Conv1DWithMasking", 
      "config": {
        "kernel_constraint": null, 
        "kernel_initializer": {
          "class_name": "VarianceScaling", 
          "config": {
            "distribution": "uniform", 
            "scale": 1.0, 
            "seed": null, 
            "mode": "fan_avg"
          }
        }, 
        "name": "conv1d_with_masking_1", 
        "bias_regularizer": null, 
        "bias_constraint": null, 
        "activation": "linear", 
        "trainable": true, 
        "padding": "same", 
        "strides": [
          1
        ], 
        "dilation_rate": [
          1
        ], 
        "kernel_regularizer": null, 
        "filters": 50, 
        "bias_initializer": {
          "class_name": "Zeros", 
          "config": {}
        }, 
        "use_bias": true, 
        "activity_regularizer": null, 
        "kernel_size": [
          3
        ]
      }
    }, 
    {
      "class_name": "LSTM", 
      "config": {
        "recurrent_activation": "hard_sigmoid", 
        "trainable": true, 
        "recurrent_initializer": {
          "class_name": "Orthogonal", 
          "config": {
            "seed": null, 
            "gain": 1.0
          }
        }, 
        "use_bias": true, 
        "bias_regularizer": null, 
        "return_state": false, 
        "unroll": false, 
        "activation": "tanh", 
        "bias_initializer": {
          "class_name": "Zeros", 
          "config": {}
        }, 
        "units": 300, 
        "unit_forget_bias": true, 
        "activity_regularizer": null, 
        "recurrent_dropout": 0.1, 
        "kernel_initializer": {
          "class_name": "VarianceScaling", 
          "config": {
            "distribution": "uniform", 
            "scale": 1.0, 
            "seed": null, 
            "mode": "fan_avg"
          }
        }, 
        "kernel_constraint": null, 
        "dropout": 0.5, 
        "stateful": false, 
        "recurrent_regularizer": null, 
        "name": "lstm_1", 
        "bias_constraint": null, 
        "go_backwards": false, 
        "implementation": 0, 
        "kernel_regularizer": null, 
        "return_sequences": true, 
        "recurrent_constraint": null
      }
    }, 
    {
      "class_name": "Dropout", 
      "config": {
        "rate": 0.5, 
        "trainable": true, 
        "name": "dropout_1"
      }
    }, 
    {
      "class_name": "MeanOverTime", 
      "config": {
        "mask_zero": true, 
        "trainable": true, 
        "name": "mean_over_time_1"
      }
    }, 
    {
      "class_name": "Dense", 
      "config": {
        "kernel_initializer": {
          "class_name": "VarianceScaling", 
          "config": {
            "distribution": "uniform", 
            "scale": 1.0, 
            "seed": null, 
            "mode": "fan_avg"
          }
        }, 
        "name": "dense_1", 
        "kernel_constraint": null, 
        "bias_regularizer": null, 
        "bias_constraint": null, 
        "activation": "linear", 
        "trainable": true, 
        "kernel_regularizer": null, 
        "bias_initializer": {
          "class_name": "Zeros", 
          "config": {}
        }, 
        "units": 1, 
        "use_bias": true, 
        "activity_regularizer": null
      }
    }, 
    {
      "class_name": "Activation", 
      "config": {
        "activation": "sigmoid", 
        "trainable": true, 
        "name": "activation_1"
      }
    }
  ], 
  "backend": "theano"
}